http-benchmarks/output/run-httpserv_effects-40000-5000.txt
Running 1m test @ http://localhost:8080
  24 threads and 5000 connections
  Thread calibration: mean lat.: 1.284ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.235ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.364ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.341ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.309ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.233ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.294ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.214ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.307ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.370ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.283ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.00ms  750.34us  15.86ms   89.80%
    Req/Sec   354.26    422.02     2.33k    80.16%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.93ms
 75.000%    1.25ms
 90.000%    1.56ms
 99.000%    3.24ms
 99.900%    9.82ms
 99.990%   12.93ms
 99.999%   14.37ms
100.000%   15.86ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.046     0.000000            1         1.00
       0.354     0.100000        40055         1.11
       0.521     0.200000        80129         1.25
       0.665     0.300000       119930         1.43
       0.800     0.400000       159958         1.67
       0.930     0.500000       200129         2.00
       0.993     0.550000       219873         2.22
       1.056     0.600000       240051         2.50
       1.119     0.650000       260088         2.86
       1.182     0.700000       279795         3.33
       1.252     0.750000       299794         4.00
       1.290     0.775000       309961         4.44
       1.331     0.800000       319819         5.00
       1.377     0.825000       329746         5.71
       1.429     0.850000       339785         6.67
       1.490     0.875000       349746         8.00
       1.524     0.887500       354700         8.89
       1.562     0.900000       359779        10.00
       1.604     0.912500       364752        11.43
       1.651     0.925000       369733        13.33
       1.708     0.937500       374698        16.00
       1.740     0.943750       377165        17.78
       1.777     0.950000       379690        20.00
       1.818     0.956250       382194        22.86
       1.866     0.962500       384670        26.67
       1.927     0.968750       387169        32.00
       1.963     0.971875       388398        35.56
       2.008     0.975000       389674        40.00
       2.063     0.978125       390897        45.71
       2.143     0.981250       392153        53.33
       2.283     0.984375       393393        64.00
       2.405     0.985938       394019        71.11
       2.577     0.987500       394644        80.00
       2.929     0.989062       395267        91.43
       3.475     0.990625       395891       106.67
       4.183     0.992188       396516       128.00
       4.575     0.992969       396830       142.22
       5.043     0.993750       397139       160.00
       5.603     0.994531       397452       182.86
       6.243     0.995313       397765       213.33
       6.975     0.996094       398075       256.00
       7.315     0.996484       398233       284.44
       7.675     0.996875       398388       320.00
       8.071     0.997266       398545       365.71
       8.415     0.997656       398704       426.67
       8.751     0.998047       398858       512.00
       8.895     0.998242       398937       568.89
       9.087     0.998437       399016       640.00
       9.311     0.998633       399090       731.43
       9.543     0.998828       399168       853.33
       9.847     0.999023       399246      1024.00
       9.967     0.999121       399285      1137.78
      10.111     0.999219       399327      1280.00
      10.239     0.999316       399364      1462.86
      10.447     0.999414       399402      1706.67
      10.655     0.999512       399442      2048.00
      10.759     0.999561       399461      2275.56
      10.919     0.999609       399480      2560.00
      11.119     0.999658       399500      2925.71
      11.263     0.999707       399519      3413.33
      11.439     0.999756       399539      4096.00
      11.543     0.999780       399550      4551.11
      11.615     0.999805       399558      5120.00
      11.831     0.999829       399568      5851.43
      12.071     0.999854       399579      6826.67
      12.623     0.999878       399588      8192.00
      12.751     0.999890       399593      9102.22
      12.935     0.999902       399598     10240.00
      13.063     0.999915       399602     11702.86
      13.167     0.999927       399607     13653.33
      13.559     0.999939       399612     16384.00
      13.639     0.999945       399615     18204.44
      13.911     0.999951       399617     20480.00
      14.047     0.999957       399619     23405.71
      14.247     0.999963       399622     27306.67
      14.287     0.999969       399625     32768.00
      14.295     0.999973       399626     36408.89
      14.303     0.999976       399628     40960.00
      14.303     0.999979       399628     46811.43
      14.319     0.999982       399629     54613.33
      14.359     0.999985       399630     65536.00
      14.367     0.999986       399632     72817.78
      14.367     0.999988       399632     81920.00
      14.367     0.999989       399632     93622.86
      14.383     0.999991       399633    109226.67
      14.383     0.999992       399633    131072.00
      14.607     0.999993       399634    145635.56
      14.607     0.999994       399634    163840.00
      14.607     0.999995       399634    187245.71
      14.743     0.999995       399635    218453.33
      14.743     0.999996       399635    262144.00
      14.743     0.999997       399635    291271.11
      14.743     0.999997       399635    327680.00
      14.743     0.999997       399635    374491.43
      15.863     0.999998       399636    436906.67
      15.863     1.000000       399636          inf
#[Mean    =        0.996, StdDeviation   =        0.750]
#[Max     =       15.856, Total count    =       399636]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  488413 requests in 1.02m, 1.00GB read
  Socket errors: connect 0, read 0, write 0, timeout 117921
Requests/sec:   7999.18
Transfer/sec:     16.71MB

JSON Output:
{
	"requests": 488413,
	"duration_in_microseconds": 61057887.00,
	"bytes": 1069624470,
	"requests_per_sec": 7999.18,
	"bytes_transfer_per_sec": 17518203.18,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 930
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 1252
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 1562
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 3243
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 9823
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 12927
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 14367
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 15863
		}
	]
}